{"general": [{"title": "Clark and Mackinlay join more than 70 Tory MPs saying they will stand down at the election – UK politics live", "description": "<ul><li>- More than 70 Tory MPs, including Clark and Mackinlay, are planning to stand down at the upcoming election.</li><li>- Energy secretary Claire Coutinho welcomed Ofgem's decision to lower the energy price cap by 7%.</li><li>- Shadow energy secretary Ed Miliband criticized the Tories for being out of touch with the cost of living crisis.</li><li>- Miliband praised Rishi Sunak for taking bold decisions and winning arguments.</li></ul>", "link": "https://www.theguardian.com/politics/live/2024/may/24/keir-starmer-rishi-sunak-uk-general-election-2024-labour-conservatives"}, {"title": "Students at two universities pack up pro-Palestine camps – as it happened", "description": "<ul><li>- Taiwan's representative to Australia, Douglas Hsu, expressed interest in engaging in critical-minerals trade with Australia.</li><li>- Hsu highlighted the scale of Australia's mining industry and intentions to bring more Taiwanese businesses to work with Australian partners.</li><li>- The focus is on preventing harm to children, intervening early to break cycles of violence and abuse.</li></ul>", "link": "https://www.theguardian.com/australia-news/live/2024/may/24/australia-news-live-albanese"}, {"title": "Sex crimes detective found guilty of sexually touching woman in NSW police station without her consent", "description": "<ul><li>- Sex crimes detective Glen Coleman found guilty of sexually touching a 19-year-old woman without her consent</li><li>- Acquitted of raping the woman but convicted of abusing his position of public office for his own sexual gratification</li><li>- The incidents occurred from March to May 2022</li><li>- Coleman was accused of sexually assaulting the woman and abusing his position as a New South Wales police officer</li></ul>", "link": "https://www.theguardian.com/australia-news/article/2024/may/24/nsw-sex-crimes-detective-found-guilty-of-sexually-touching-woman-in-police-station-without-her-consent-ntwnfb"}, {"title": "‘Crisis in dental care’: Bernie Sanders on his fight for better teeth for Americans", "description": "<ul><li>- Bernie Sanders' bill aims to improve access to oral healthcare by adding dental benefits to Medicare and enhancing them in Medicaid.</li><li>- The bill targets 115 million older and lower-income Americans who struggle to afford dental care.</li><li>- Despite America's reputation for a \"Hollywood smile,\" millions face difficulties accessing basic dental care.</li><li>- Statistics show that one in five US seniors have lost all their natural teeth, nearly half of adults have gum disease, and cavities are a common reason for children missing school.</li></ul>", "link": "https://www.theguardian.com/us-news/article/2024/may/24/bernie-sanders-dental-health-care-bill"}, {"title": "Post Office Horizon IT inquiry: tearful Vennells’ claim she worked as hard as she could dismissed as ‘absolute rubbish’ – live", "description": "<ul><li>- Victims' lawyer responds to tearful monologue by former Post Office chief executive</li><li>- Chair Wyn Williams confirms timetable for the day</li><li>- Edward Henry KC and Sam Stein KC to question for an hour each representing victim groups</li><li>- Legal teams for National Federation of Subpostmasters and Susan Sinclair to ask questions before lunch</li></ul>", "link": "https://www.theguardian.com/uk-news/live/2024/may/24/paula-vennells-post-office-horizon-it-inquiry-day-3-alan-bates-live-updates"}, {"title": "Ex-AFL player Barry Cable charged with historical child sexual abuse offences", "description": "<ul><li>- Barry Cable, a former AFL player, has been charged with historical sex offenses against a young girl.</li><li>- Western Australian police allege that Cable sexually assaulted the girl when she was between nine and 10 years old in 1967 and 1968.</li><li>- The 80-year-old has been charged with five counts of indecent dealing with a girl under 13 and two counts of unlawful carnal knowledge of a girl under 13.</li></ul>", "link": "https://www.theguardian.com/australia-news/article/2024/may/24/ex-afl-player-barry-cable-charged-with-historic-child-sexual-abuse-offences"}, {"title": "Kelly Rowland alleges racial profiling in Cannes film festival usher incident", "description": "<ul><li>- Kelly Rowland, from Destiny’s Child, confronted a Cannes film festival usher at the premiere of Marcello Mio.</li><li>- Rowland suggested she was racially profiled during the incident on the red carpet.</li><li>- She argued with a festival usher, pointing out the behavior she perceived as discriminatory.</li></ul>", "link": "https://www.theguardian.com/music/article/2024/may/24/kelly-rowland-alleges-racial-profiling-in-cannes-film-festival-usher-incident"}, {"title": "Peruvian reporter who challenged political elite faces smear campaign", "description": "<ul><li>- Gustavo Gorriti, a Peruvian reporter known for exposing corruption for over 4 decades, is now facing a smear campaign.</li><li>- Gorriti's investigative work includes uncovering government corruption, such as in the Operation Car Wash scandal that implicated many Peruvian presidents.</li><li>- He gained recognition for reporting on the Shining Path conflict and was kidnapped during Alberto Fujimori's power grab after revealing Vladimiro Montesinos' activities.</li><li>- The criminal investigation against Gorriti is denounced as politically motivated by campaigners.</li></ul>", "link": "https://www.theguardian.com/global-development/article/2024/may/24/gustavo-gorriti-reporter-peru"}], "finance": [{"title": "Ex-Post Office boss agreed with PR who advised her to ditch review into 'past cases' to avoid 'front page news'", "description": "<ul><li>- Ex-Post Office boss Paula Vennells agreed to drop reviews into \"past cases\" of sub-postmasters in 2013 based on advice from a PR adviser</li><li>- The PR adviser suggested this action would prevent media interest from escalating about the cases</li><li>- This revelation came to light during the Horizon IT inquiry.</li></ul>", "link": "https://news.sky.com/story/ex-post-office-boss-paula-vennells-agreed-with-pr-who-advised-her-to-ditch-review-into-past-cases-to-avoid-front-page-news-13141812"}, {"title": "If Paula Vennells's first day was about ignorance, then day two made ignorance look like bliss", "description": "<ul><li>- Paula Vennells faced public scrutiny on her second day in the witness stand.</li><li>- The second day was less dramatic but more substantial than the first.</li><li>- Vennells made further statements and provided insights during the inquiry.</li></ul>", "link": "https://news.sky.com/story/post-office-inquiry-if-paula-vennellss-first-day-was-about-ignorance-then-day-two-made-ignorance-look-like-bliss-13142079"}, {"title": "Ex-Nvidia recruiter’s No. 1 resume red flag: It makes you look like ‘there wasn't a whole lot of effort’", "description": "<ul><li>- Ex-Nvidia recruiter Stefanie Fackrell warns against resume red flags</li><li>- Avoid listing daily job tasks on resume</li><li>- Use black ink for resume drafting</li><li>- Emphasize the importance of putting effort into your resume</li></ul>", "link": "https://www.cnbc.com/2024/05/23/ex-nvidia-recruiters-top-resume-red-flags.html"}, {"title": "Stocks hit record again. Is Trump the reason?", "description": "<ul><li>- Stocks reached all-time highs</li><li>- Trump is considered by many as the reason behind the market's success</li><li>- Stocks were rising when there was optimism about Hillary Clinton winning</li><li>- Janet Yellen and the Federal Reserve may also have contributed significantly to the market's growth</li></ul>", "link": "http://money.cnn.com/2017/02/13/investing/stocks-all-time-highs-donald-trump-janet-yellen-fed/index.html?section=money_news_international"}, {"title": "Verizon's plan: Consumers win, investors lose", "description": "<ul><li>- Verizon has reintroduced unlimited data plans for consumers.</li><li>- This move is beneficial for subscribers but negative for investors.</li><li>- The telecom industry's intense competition is highlighted by such decisions.</li><li>- Verizon's stock performance has been negatively impacted by the reintroduction of unlimited data plans.</li></ul>", "link": "http://money.cnn.com/2017/02/13/investing/verizon-stock-unlimited-data-plan/index.html?section=money_news_international"}, {"title": "Ether slips after SEC opens the door to ether ETFs, still heads for best week in more than a year", "description": "<ul><li>- Ether dropped on Friday after the SEC endorsed a rule change allowing ETFs to invest in the cryptocurrency</li><li>- Ether still on track for its best week in over a year</li></ul>", "link": "https://www.cnbc.com/2024/05/24/crypto-market-today.html"}, {"title": "Work Advice: An old co-worker is back and publicizing my cringey history", "description": "<ul><li>- An individual is facing drama at their new workplace due to an old colleague publicizing a messy breakup with a co-worker from ten years ago.</li><li>- The old colleague's actions are causing discomfort and potentially damaging the individual's reputation.</li><li>- The individual is seeking advice on how to handle the situation and stop the gossip from spreading further.</li></ul>", "link": "https://www.washingtonpost.com/business/2024/05/23/work-advice-toxic-colleague-gossip/"}, {"title": "GM CEO Mary Barra says she has no plans to retire soon as automaker's transformation continues", "description": "<ul><li>- GM CEO Mary Barra stated she has no plans to retire soon</li><li>- Barra emphasizes the importance of ensuring the company's transformation is on track</li></ul>", "link": "https://www.cnbc.com/2024/05/23/gm-ceo-mary-barra-has-no-plans-to-retire.html"}], "technology": [{"title": "Your earbuds and you: What all that listening is doing to us", "description": "<ul><li>- Many people wear earbuds for extended periods, impacting hearing health.</li><li>- Host Manoush Zomorodi discusses headphone habits with exposure scientist Rick Neitzel.</li><li>- Neitzel collaborates with Apple on a study about daily sound exposure and listening habits' impact on hearing.</li><li>- Neitzel provides advice on safe listening practices for long-term ear protection.</li><li>- Discussion on the future of \"consumer hearables\" and tech companies' push for constant earbud usage.</li><li>- Interested individuals can join the Apple Hearing Study through the provided link.</li></ul>", "link": "https://www.npr.org/2024/05/20/1247296773/what-your-earbuds-are-doing-to-your-hearing"}, {"title": "How Israel is using facial recognition in Gaza", "description": "<ul><li>- Israel deployed facial recognition software in Gaza after Hamas attack</li><li>- Hundreds of thousands of Palestinians fled to the South of Gaza</li><li>- Palestinians reported passing through checkpoints with cameras</li><li>- Facial recognition system in Gaza launched late last year with private companies and Google's help</li><li>- Investigation led by The New York Times reporter Sheera Frenkel</li><li>- Science correspondent Geoff Brumfiel interviewed Frenkel about the facial recognition technology in Gaza</li></ul>", "link": "https://www.npr.org/2024/05/24/1198910043/gaza-israel-facial-recognition"}, {"title": "What parents should know about the VR gear kids want", "description": "<ul><li>- Guide to choosing virtual reality gear for families during the holidays.</li><li>- Includes options from Google Cardboard VR to Sony PlayStation VR.</li><li>- Helps determine suitable choices based on family interests, needs, and budget.</li></ul>", "link": "http://www.cnn.com/2016/11/14/health/virtual-reality-gear-kids-holidays/index.html?eref=rss_tech"}, {"title": "Going to space is a real pain in the back", "description": "<ul><li>- Astronauts on a six-month stay at the International Space Station experience back pain.</li><li>- The space environment can cause astronauts to temporarily gain up to 2 inches in height.</li><li>- However, this height gain is coupled with weakened muscles supporting the spine.</li></ul>", "link": "http://www.cnn.com/2016/10/26/health/astronaut-back-pain-spine-health-space/index.html?eref=rss_tech"}, {"title": "TikTok creators sue U.S. government in a bid to stop potential ban", "description": "<ul><li>- TikTok creators sued the U.S. government, claiming that potential ban violates their free speech rights under the 1st Amendment</li><li>- The law aims to compel Chinese owner ByteDance to sell the app</li></ul>", "link": "https://www.latimes.com/entertainment-arts/business/story/2024-05-15/tiktok-creators-sue-u-s-government-in-a-bid-to-stop-potential-ban"}, {"title": "Mike Tyson to fight Jake Paul. Yes, an ex-heavyweight champ is boxing a YouTuber on Netflix", "description": "<ul><li>- Jake Paul, criticized for facing lesser opponents, is set to fight Mike Tyson, a boxing legend, who will be 58 years old during the July 20 match.</li><li>- The bout between the controversial YouTuber and the former heavyweight champion will be streamed on Netflix.</li></ul>", "link": "https://www.latimes.com/sports/story/2024-03-07/mike-tyson-jake-paul-boxing-fight-netflix"}, {"title": "Column: This was the year of AI. Next year is when you should worry about your job", "description": "<ul><li>- Questions regarding job replacement by AI will become more pressing in the next year.</li><li>- Urgency and existential concerns regarding automation of work are rising.</li><li>- The article discusses the increasing impact of AI on job security and the imminent threat to various job sectors.</li></ul>", "link": "https://www.latimes.com/business/technology/story/2023-12-14/column-this-was-the-year-of-ai-next-year-is-when-you-have-to-worry"}, {"title": "An AI app claims it can detect sexually transmitted infections. Doctors say it's a disaster", "description": "<ul><li>- Calmara app claims it can detect sexually transmitted infections from penis photos</li><li>- Doctors criticize the app, calling it a disaster</li><li>- Concerns raised about accuracy and ethical implications</li><li>- Medical experts warn against relying on such apps for diagnosis</li></ul>", "link": "https://www.latimes.com/science/story/2024-04-07/calmara-claims-it-can-detect-stis-doctors-say-its-a-disaster"}], "health": [{"title": "Anti-abortion hardliners want restrictions to go farther. It could cost Republicans", "description": "<ul><li>- Abortion rights is a key political issue with increased intensity.</li><li>- Anti-abortion activists seek stricter restrictions and criminalization of patients.</li><li>- They aim to ban procedures like IVF.</li><li>- There is a potential cost for Republicans due to these extreme measures in the abortion debate.</li></ul>", "link": "https://www.npr.org/2024/05/23/1198912380/abortion-abolition-republicans-rights-elections-roe-wade-2024-trump-biden"}, {"title": "'It's a lot of UFO stuff and a lot of healing': Inside L.A.'s wackiest spiritual convention", "description": "<ul><li>- The Conscious Life Expo in Los Angeles has been a gathering place for individuals involved in astrology, channeling, aura reading, quantum life coaching, and other spiritual practices for 22 years.</li><li>- Participants at the expo include psychics, hypnotists, and \"starseeds,\" who believe they are galactic volunteers helping humanity.</li><li>- The event features discussions on topics such as aliens, chakras, energy healing, and spirituality.</li><li>- Attendees have diverse beliefs and engage in activities focused on personal growth and healing.</li></ul>", "link": "https://www.latimes.com/lifestyle/story/2024-02-19/la-spiritual-convention-conscious-life-expo-aliens-chakra-energy-healing"}, {"title": "Column: California wants to mandate folic acid in tortillas to help babies. Why that's bad", "description": "<ul><li>- California is considering mandating folic acid in tortillas to reduce birth defects.</li><li>- Folic acid helps prevent spinal cord and brain birth defects.</li><li>- Experts argue that mandating folic acid in tortillas could be ineffective and potentially harmful.</li><li>- Critics of the mandate suggest alternative methods to increase folic acid consumption.</li></ul>", "link": "https://www.latimes.com/california/story/2024-05-22/tortillas-folic-acid-corn-masa-california"}, {"title": "He wasn't a crier, but then his wife died — and the tears wouldn't stop. How one father found his way forward", "description": "<ul><li>- Warren Kozak, after losing his wife, wrote a book about his experience.</li><li>- His book about loss turned out to be more about love.</li><li>- The article discusses how Kozak navigated grief and found a way forward.</li></ul>", "link": "https://www.latimes.com/entertainment-arts/books/story/2024-04-17/coping-with-death-of-spouse-waving-goodbye-warren-kozak"}, {"title": "Two men killed while pointing guns at the ground. Should police have waited?", "description": "<ul><li>- Police are trained to shoot when the threat is imminent, not necessarily when the gun is raised.</li><li>- Cognitive research suggests people should not be shot solely based on holding a gun at their side.</li><li>- Recent police killings in Florida and Alaska have prompted discussions about police encounters with armed individuals.</li></ul>", "link": "https://www.npr.org/2024/05/23/nx-s1-4970723/police-guns-shootings-armed-bodycam-deadly-force"}, {"title": "The 'soup for dinner' life: It's easy, delicious. A never-boring way to slim down", "description": "<ul><li>- Quick soups, simmering soups, and foolproof soups are highlighted as an easy method for home cooks to reduce calorie intake.</li><li>- The diet involving soups is described as a way to stay engaged and satisfied without getting bored.</li><li>- The article suggests that soup-based meals can assist in weight loss while being tasty and simple to prepare.</li></ul>", "link": "https://www.latimes.com/food/story/2024-03-27/soup-for-dinner-diet-the-easiest-and-delicious-way-to-lose-weight-recipes"}, {"title": "California is making fentanyl test strips free to organizations. How to get a kit", "description": "<ul><li>- California is providing free fentanyl-testing strips to eligible organizations across the state.</li><li>- The initiative aims to reduce synthetic opioid-related deaths.</li><li>- Organizations can request the free test strips through the state Department of Health Care Services.</li></ul>", "link": "https://www.latimes.com/california/story/2024-03-29/california-is-making-fentanyl-test-strips-free-to-organizations-how-to-get-a-kit"}, {"title": "An AI app claims it can detect sexually transmitted infections. Doctors say it's a disaster", "description": "<ul><li>- The Calmara app claims it can detect sexually transmitted infections (STIs) from photos of penises.</li><li>- Doctors criticize the app, stating that there are many issues with it.</li><li>- One doctor describes the app as a disaster.</li><li>- Calmara's accuracy and reliability in identifying STIs are questioned by medical professionals.</li></ul>", "link": "https://www.latimes.com/science/story/2024-04-07/calmara-claims-it-can-detect-stis-doctors-say-its-a-disaster"}], "sports": [{"title": "The Boston Celtics become the first team to hit 30 wins this season with victory over the New Orleans Pelicans", "description": "<ul><li>- The Boston Celtics are the first team in the NBA this season to reach 30 wins.</li><li>- They achieved this milestone by defeating the New Orleans Pelicans 125-114.</li><li>- The victory was driven by the performance of the team's key players, Jayson Tatum and Jaylen Brown, who scored a combined 72 points in the game.</li></ul>", "link": "https://www.cnn.com/2023/01/12/sport/boston-celtics-30-wins-pelicans-nba-spt-intl/index.html"}, {"title": "Arrow McLaren's Pato O'Ward confident as he dreams of first Indy 500 victory: 'We’ve got a shot'", "description": "<ul><li>- Pato O'Ward of Arrow McLaren has come close to winning the past two Indy 500 races</li><li>- Despite previous setbacks, O'Ward remains confident in his chances for victory this weekend</li></ul>", "link": "https://www.foxnews.com/sports/arrow-mclarens-pato-oward-confident-dreams-first-indy-500-victory"}, {"title": "Why some of California's most outdoorsy people are moving to...Las Vegas?", "description": "<ul><li>- Elite outdoor athletes are moving to Las Vegas for its proximity to outdoor activities.</li><li>- They are buying homes, starting families, and considering Las Vegas the adventure sports capital of the U.S.</li></ul>", "link": "https://www.latimes.com/california/story/2024-05-22/why-elite-california-climbers-are-moving-to-las-vegas"}, {"title": "UFC president Dana White does not expect punishment for domestic violence incident", "description": "<ul><li>- UFC president Dana White stated that he does not expect punishment for a domestic violence incident involving his wife.</li><li>- A video depicting White in a physical altercation with his wife surfaced earlier this month.</li><li>- White made the comments during a media day for UFC Fight Night 217.</li></ul>", "link": "https://www.cnn.com/2023/01/12/sport/dana-white-ufc-domestic-violence-spt-intl/index.html"}, {"title": "Three-time major winner admits to missing LIV golfers after PGA Championship, calls for solution between tours", "description": "<ul><li>- Three-time major winner Padraig Harrington expresses missing LIV Golf players after PGA Championship.</li><li>- Calls for a solution to bridge the gap between tours in golf.</li></ul>", "link": "https://www.foxnews.com/sports/three-time-major-winner-admits-missing-liv-golfers-after-pga-championship-calls-solution-between-tours"}, {"title": "Australia pulls out of Afghanistan cricket series over Taliban's restrictions on women", "description": "<ul><li>- Australia's men's cricket team has pulled out of upcoming matches against Afghanistan in response to the Taliban's restrictions on women and girls' rights.</li><li>- Cricket Australia announced the decision, citing concerns over the rights of women, particularly in education and employment.</li><li>- The team's withdrawal is seen as a protest against the Taliban's policies on gender equality.</li><li>- The move comes amid growing international pressure on the Taliban to uphold human rights standards.</li></ul>", "link": "https://www.cnn.com/2023/01/12/sport/australia-afghanistan-cricket-taliban-intl-hnk-spt/index.html"}, {"title": "Damar Hamlin has been released after spending more than a week hospitalized due to a cardiac arrest", "description": "<ul><li>- Damar Hamlin released from hospital after more than a week following a cardiac arrest during \"Monday Night Football.\"</li><li>- Buffalo Bills announced the news on Wednesday.</li></ul>", "link": "https://www.cnn.com/2023/01/11/sport/damar-hamlin-buffalo-bills-hospital-release-spt/index.html"}, {"title": "Pelé's final hurrah at New York Cosmos helped spark 'sporting revolution'", "description": "<ul><li>- Pelé's move to the New York Cosmos in the US helped ignite a revolution in soccer in North America.</li><li>- Despite already achieving immense success, Pelé's impact in transforming the sport was significant.</li><li>- The legendary player's influence extended beyond his on-field performance and contributed to the growth of soccer in the region.</li><li>- Pelé's involvement with the New York Cosmos marked a pivotal moment in the development of soccer in North America.</li></ul>", "link": "https://www.cnn.com/2022/12/31/football/pele-new-york-cosmos-north-america-revolution-spt-intl/index.html"}], "entertainment": [{"title": "The Real Housewife-ification of Congress; And, 25 years of being pilled by The Matrix", "description": "<ul><li>- Representatives Marjorie Taylor Greene and Jasmine Crockett engaged in a heated exchange on the House floor</li><li>- Greene made a comment about Crockett's eyelashes, and Crockett referred to Greene's body as \"butch\"</li><li>- The article delves into the history behind these attacks, touching on issues such as misogynoir and transphobia</li><li>- The discussion also reflects on the expectations from politicians</li><li>- 'The Matrix' movie, released 25 years ago, is analyzed for its enduring relevance and appeal to different groups like trans people and incels who \"took the red pill\"</li><li>- The article explores the movie's core metaphor and its broad significance.</li></ul>", "link": "https://www.npr.org/2024/05/24/1197956488/the-real-housewife-ification-of-congress-and-25-years-of-being-pilled-by-the-mat"}, {"title": "'Furiosa: A Mad Max Saga' goes full throttle", "description": "<ul><li>- 'Furiosa: A Mad Max Saga' features bone-crunching stunts and diesel-powered chase scenes</li><li>- Directed by George Miller</li><li>- Prequel film starring Furiosa (Anya Taylor-Joy)</li><li>- Furiosa seeks revenge on an evil warlord (Chris Hemsworth)</li><li>- Themes of feminism, environmentalism, and humanity tackled in the movie</li></ul>", "link": "https://www.npr.org/2024/05/24/1197964846/furiosa-a-mad-max-saga-goes-full-throttle"}, {"title": "Does 'The Sympathizer' worthily adapt its acclaimed book?", "description": "<ul><li>- HBO's \"The Sympathizer\" is based on a Pulitzer Prize-winning novel and co-created by director Park Chan-wook.</li><li>- The series features Robert Downey, Jr. in four supporting roles.</li><li>- The show follows a character played by Hoa Xuande, who is both part of the South Vietnamese military and a spy for the North Vietnamese.</li><li>- The question posed is whether \"The Sympathizer\" is a worthy adaptation of its acclaimed book.</li></ul>", "link": "https://www.npr.org/2024/05/23/1197964774/does-the-sympathizer-worthily-adapt-its-acclaimed-book"}, {"title": "'Glass Onion' sharpens the 'Knives Out' formula in a polished Netflix sequel", "description": "<ul><li>- \"Glass Onion: A Knives Out Mystery\" sharpens the 'Knives Out' formula in a Netflix sequel</li><li>- Maintains the razor-sharp formula of the successful predecessor</li><li>- Setup reminiscent of an Agatha Christie homage before clever twists</li><li>- Writer-director Rian Johnson assembles a solid cast behind Daniel Craig</li><li>- Emphasis on the use of language with no wasted words gives the sequel an edge</li></ul>", "link": "https://www.cnn.com/2022/11/23/entertainment/glass-onion-a-knives-out-mystery-review/index.html"}, {"title": "In 'Wednesday,' Jenna Ortega makes Netflix's Addams Family series look like a snap", "description": "<ul><li>- \"Wednesday\" is a new Netflix series featuring Jenna Ortega</li><li>- Jenna Ortega plays the now-high-school-age daughter of the Addams Family</li><li>- The character is portrayed as a cool, humorless goth sociopath</li><li>- The series is described as more kooky than spooky or ooky.</li></ul>", "link": "https://www.cnn.com/2022/11/22/entertainment/wednesday-review/index.html"}, {"title": "'Willow' revives the Lucasfilm fantasy with a more contemporary streaming adventure", "description": "<ul><li>- Disney's \"Willow\" revival series on Disney+ brings back original star Warwick Davis.</li><li>- The revival series features a more contemporary narrative focusing on the next generation.</li><li>- The original 1988 movie is described as \"beloved\" in Disney's press materials.</li><li>- Despite being nostalgic, the original film is considered a generic George Lucas-plotted fantasy.</li><li>- The series provides a different take on the story, introducing new elements and characters.</li></ul>", "link": "https://www.cnn.com/2022/11/30/entertainment/willow-review/index.html"}, {"title": "Does 'IF' capture the magic of its Pixar inspiration?", "description": "<ul><li>- Movie IF features a 12-year-old girl who can see imaginary friends</li><li>- Stars Cailey Fleming, Ryan Reynolds, and directed by John Krasinski</li><li>- Blends real-world and animation</li><li>- Question raised on whether IF captures the magic of Pixar movies</li></ul>", "link": "https://www.npr.org/2024/05/22/1197964746/does-if-capture-the-magic-of-its-pixar-inspiration"}, {"title": "'Love Actually' cast to reunite for 20th anniversary TV special", "description": "<ul><li>- \"Love Actually\" cast members to reunite for a TV special</li><li>- The TV special will mark the 20th anniversary of the movie</li><li>- The romantic comedy \"Love Actually\" was released in 2003</li><li>- The reunion special will be aired on ABC next week, as announced by the network</li></ul>", "link": "https://www.cnn.com/2022/11/22/entertainment/love-actually-20th-anniversary-abc-special/index.html"}]}